/***************************************************************************

     Cofdet开源项目:嵌入式系统通用驱动程序接口及其实现1-IO口实验
功能说明: 当按下TEST键时,提示灯亮
注: 此文件不依赖于具本硬件与实验开发环境
***************************************************************************/

/***************************************************************************
                           实验功能要求
***************************************************************************/
//1个按键(假定默认为低电平有效,否则请重实现本地化代码IsTEST()为按键按下状态)
//1个指示灯(假定默认为低电平亮,否则请重实现本地化代码ClrLIGHT()为亮状态)

#include "IOCtrl.h"

//-------------------------main函数实现--------------------------------------
int main(void)//注意此行main写法是否符合平台要求,若不符合，请本地化
{
  IOCtrl_Init();
  CfgLIGHT();
  CfgTEST();

  for(;;){
    if(IsTEST())
      ClrLIGHT();
    else
      SetLIGHT();
  }
}
